
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкаПодсказок();
	
КонецПроцедуры

&НаСервере
Процедура НастройкаПодсказок()
	
	Элементы.ПроверкаУсловия.РасширеннаяПодсказка.Заголовок = мдмКонструкторФормыКлиентСервер.ФорматированнаяСтрока(
		НСтр("ru = '<b>Событие вычисления условия на точке.</b>
		            |
					|<b>Контекст события</b>:
					|	<b>Контекст</b> - Структура - элементы структуры:
					|		Объект - БизнесПроцессОбъект.мдмПроцессОбработки - объект текущего бизнес-процесса.
					|		Результат - Булево - Истина - Да, Ложь - нет.'")	
		);
		
КонецПроцедуры	
