
#Область ПрограммныйИнтерфейс

Процедура ОбработатьСобытиеПриИзмененииНаСервере(Форма, Элемент) Экспорт
			
КонецПроцедуры	

Процедура ОбработатьСобытиеДействиеНаСервере(Форма, Имя, ВходныеПараметры, ВыходныеПараметры) Экспорт
	
КонецПроцедуры	

Процедура ОбработатьСобытиеПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры	

Процедура ОбработатьСобытиеОбработкаПроверкиЗаполненияНаСервере(Форма, Отказ, ПроверяемыеРеквизиты) Экспорт
	
КонецПроцедуры

Процедура ОбработатьСобытиеПередЗаписьюНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
КонецПроцедуры	

Процедура ОбработатьСобытиеПриУсловномОформлении(Форма) Экспорт
	
КонецПроцедуры

Процедура ОбработатьСобытиеДействиеКомандыНаСервере(Форма, Команда) Экспорт
	
КонецПроцедуры

#КонецОбласти

