
#Область ПрограммныйИнтерфейс

Функция КлючОбъекта() Экспорт
	Возврат "Имя,Владелец";
КонецФункции	

#КонецОбласти

Процедура ПриЗаписи(Отказ)
	
	Если ПометкаУдаления И Не Точка.ПометкаУдаления тогда
		ТочкаОбъект = Точка.ПолучитьОбъект();
		ТочкаОбъект.ДополнительныеСвойства.Вставить("НеВыполнятьПроверкиЗаполнения");
		ТочкаОбъект.УстановитьПометкуУдаления(Истина);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ЗначениеЗаполнено(Точка) тогда
		ТочкаОбъект = Точка.ПолучитьОбъект();
		ТочкаОбъект.Удалить();
	КонецЕсли;
	
КонецПроцедуры

