
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытийФормы

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)

	мдмБизнесПроцессыСобытия.ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция ПолучитьПоИмени(Имя, БизнесПроцесс) Экспорт
	
	Возврат ЭтотОбъект().НайтиПоРеквизиту("Имя", Имя,, БизнесПроцесс);
	
КонецФункции

Функция СоздатьОбновитьТочки(Точка, Элемент, БизнесПроцесс) Экспорт
	
	Возврат мдмТочкиБизнесПроцесса.СоздатьОбновитьТочки(ЭтотОбъект(), Точка, Элемент, БизнесПроцесс);
	
КонецФункции	

Функция ОбновитьСвязиТочки(Точка, ТаблицаСвязей) Экспорт

	ТочкаОбъект = Точка.ПолучитьОбъект();
	
	ТочкаОбъект.Входы.Очистить();
	ТочкаОбъект.Выходы.Очистить();
	
	Для Каждого Связь из ТаблицаСвязей цикл
		
		Если Связь.Начало = Точка.Имя тогда
			
			ТекущаяТочка = Справочники.мдмТочкиБизнесПроцесса.ПолучитьПоИмени(Связь.Конец, Точка.Владелец);
			
			Если ЗначениеЗаполнено(ТекущаяТочка) тогда
				НоваяСтрока = ТочкаОбъект.Выходы.Добавить();
				НоваяСтрока.Точка = ТекущаяТочка.Точка;
				НоваяСтрока.Результат = ?(Врег(СокрЛП(Связь.Наименование)) = "ДА", Истина, Ложь);
			КонецЕсли;
			
		ИначеЕсли Связь.Конец = Точка.Имя тогда	
			
			ТекущаяТочка = Справочники.мдмТочкиБизнесПроцесса.ПолучитьПоИмени(Связь.Начало, Точка.Владелец);
			
			Если ЗначениеЗаполнено(ТекущаяТочка) тогда
				НоваяСтрока = ТочкаОбъект.Входы.Добавить();
				НоваяСтрока.Точка = ТекущаяТочка.Точка;
			КонецЕсли;	
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	ТочкаОбъект.ДополнительныеСвойства.Вставить("НеВыполнятьПроверкиЗаполнения");
	ТочкаОбъект.Записать();
	
	Возврат Точка;
	
КонецФункции	

Функция ЭтотОбъект() Экспорт
	
	Возврат Справочники.мдмТочкиУсловие;
	
КонецФункции	

Функция ЕстьВходы() Экспорт
	Возврат Истина;
КонецФункции	

Функция ЕстьВыходы() Экспорт
	Возврат Истина;
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли