
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТипыОбъектовМастерДанных = мдмМетаданные.ТипыОбъектовМастерДанных();
	
	Для Каждого Тип из ТипыОбъектовМастерДанных.Типы() цикл
		
		ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
		Если ОбъектМетаданных <> Неопределено тогда
			Список.Добавить().Имя = ОбъектМетаданных.ПолноеИмя();
		КонецЕсли;	
		
	КонецЦикла;	
	
	Список.Сортировать("Имя");
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ВыбратьОбъект();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбратьОбъект();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОбъект()
	
	ДанныеСтроки = Элементы.Список.ТекущиеДанные;
	Если ДанныеСтроки = Неопределено тогда
		ПоказатьПредупреждение(, "Выберите строку.");
		Возврат;
	КонецЕсли;	
	
	ОповеститьОВыборе(ДанныеСтроки.Имя);
	
КонецПроцедуры

