
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	мдмБизнесПроцессыСобытия.ОбработкаПолученияПолейПредставленияМетаданных(Поля, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	мдмБизнесПроцессыСобытия.ОбработкаПолученияПредставленияМетаданных(Данные, Представление, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецЕсли