
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура СформироватьПредставление(НаименованиеВладельца = "") Экспорт
	
	//Если ТипЗнч(Владелец) = Тип("СправочникСсылка.СхемыДанных") тогда
	//	
	//	Если НаименованиеВладельца = "" тогда
	//		НаименованиеВладельца = Владелец.Наименование;	
	//	КонецЕсли;	
	//	
	//	ПредставлениеСсылки = НаименованиеВладельца + "." + Имя;
	//	
	//ИначеЕсли ТипЗнч(Владелец) = Тип("СправочникСсылка.ТабличныеЧасти") тогда	
	//	
	//	Если НаименованиеВладельца = "" тогда
	//		НаименованиеВладельца = Владелец.Имя;	
	//	КонецЕсли;	
	//	
	//	ПредставлениеСсылки = Владелец.Владелец.Наименование + "." + НаименованиеВладельца + "." + Имя;
	//	
	//ИначеЕсли ТипЗнч(Владелец) = Тип("СправочникСсылка.ФормыОбъектовБизнесПроцессов") тогда		
	//	
	//	Если НаименованиеВладельца = "" тогда
	//		НаименованиеВладельца = Владелец.Наименование;	
	//	КонецЕсли;	
	//	
	//	ПредставлениеСсылки = НаименованиеВладельца + "." + Имя;
	//	
	//КонецЕсли;	
	
	ПредставлениеСсылки = Имя;
	
КонецПроцедуры	

Функция КлючОбъекта() Экспорт
	
	Если ТипЗнч(Владелец) = Тип("СправочникСсылка.мдмФормыДанных") тогда

		Владельцы = Новый Массив;
		Владельцы.Добавить(Владелец);
		Владельцы.Добавить(Владелец.СхемаДанных);
		
		Ключ = Новый Структура;
		Ключ.Вставить("Имя", Имя);
		Ключ.Вставить("Владелец", Владельцы);
		
	ИначеЕсли ТипЗнч(Владелец) = Тип("СправочникСсылка.мдмСхемыДанных") тогда

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ФормыДанныхБизнесПроцесса.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.мдмФормыДанных КАК ФормыДанныхБизнесПроцесса
			|ГДЕ
			|	ФормыДанныхБизнесПроцесса.СхемаДанных = &СхемаДанных";
		
		Запрос.УстановитьПараметр("СхемаДанных", Владелец);
		
		Владельцы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		Владельцы.Добавить(Владелец);
		
		Ключ = Новый Структура;
		Ключ.Вставить("Имя", Имя);
		Ключ.Вставить("Владелец", Владельцы);
		
	Иначе 
		
		Ключ = "Имя,Владелец";
		
	КонецЕсли;	
	
	
	Возврат Ключ;
	
КонецФункции	

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	СформироватьПредставление();
	
	ТипПредставление = мдмМетаданные.ПредставлениеТипа(Тип.Получить());
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

