
#Область ПрограммныйИнтерфейс

Процедура ОбработатьСобытиеПриОбработкеОповещения(Форма, Результат, ДополнительныеПараметры) Экспорт

КонецПроцедуры	

Процедура ОбработатьСобытиеПередЗаписью(Форма, Отказ, ПараметрыЗаписи) Экспорт 
	
КонецПроцедуры	

Процедура ОбработатьСобытиеПослеЗаписи(Форма, ПараметрыЗаписи) Экспорт
	
КонецПроцедуры	

Процедура ОбработатьСобытиеПередЗакрытием(Форма, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Экспорт 
	
КонецПроцедуры	

Процедура ОбработатьСобытиеПриИзменении(Форма, Элемент) Экспорт
	
КонецПроцедуры	

Процедура ОбработатьСобытиеНачалоВыбора(Форма, Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры	

Процедура ОбработатьСобытиеОбработкаВыбора(Форма, Элемент, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры	

Процедура ОбработатьСобытиеПриНачалеРедактирования(Форма, Элемент, НоваяСтрока, Копирование) Экспорт
	
КонецПроцедуры

Процедура ОбработатьСобытиеПриОкончанииРедактирования(Форма, Элемент, НоваяСтрока, ОтменаРедактирования) Экспорт
	
КонецПроцедуры

Процедура ОбработатьСобытиеПередУдалением(Форма, Элемент, Отказ) Экспорт
	
КонецПроцедуры

Процедура ОбработатьСобытиеПослеУдаления(Форма, Элемент) Экспорт
	
КонецПроцедуры

Процедура ОбработатьСобытиеПередНачаломДобавления(Форма, Элемент, Отказ, Копирование, Родитель, Группа, Параметр) Экспорт
	
КонецПроцедуры

Процедура ОбработатьСобытиеПередНачаломИзменения(Форма, Элемент, Отказ) Экспорт
	
КонецПроцедуры	

Процедура ОбработатьСобытиеДействиеКоманды(Форма, Команда) Экспорт
	
КонецПроцедуры	

#КонецОбласти