
#Область ПрограммныйИнтерфейс

// НАЧАЛО БизнесПроцессыФормы

Функция ЭлементДанныхФормы() Экспорт
	
	Возврат Элементы._СтраницаОсновное;
	
КонецФункции	

&НаСервере
Процедура ОбновитьУсловноеОформлениеНаСервере() Экспорт
	
	мдмБизнесПроцессыФормыСервер.ОбновитьУсловноеОформление(ЭтотОбъект);
	
КонецПроцедуры	

&НаСервере
Процедура ПриИзмененииНаСервере(ИмяЭлемента) Экспорт
	
	мдмБизнесПроцессыФормыСервер.ОбработатьСобытиеПриИзмененииНаСервере(ЭтотОбъект, ИмяЭлемента);
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриОбработкеОповещения(Результат, ДополнительныеПараметры) Экспорт
	
	мдмБизнесПроцессыФормыКлиент.ОбработатьСобытиеПриОбработкеОповещения(ЭтотОбъект, Результат, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОбработкеОповещенияОдинПараметр(ДополнительныеПараметры) Экспорт
	
	мдмБизнесПроцессыФормыКлиент.ОбработатьСобытиеПриОбработкеОповещения(ЭтотОбъект, Неопределено, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ДействиеНаСервере(Имя, ВходныеПараметры, ВыходныеПараметры) Экспорт
	
	мдмБизнесПроцессыФормыСервер.ОбработатьСобытиеДействиеНаСервере(ЭтотОбъект, Имя, ВходныеПараметры, ВыходныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ДействиеКомандыНаСервере(Команда) Экспорт
	
	мдмБизнесПроцессыФормыСервер.ОбработатьСобытиеДействиеКомандыНаСервере(ЭтотОбъект, Команда);
	
КонецПроцедуры	

&НаСервере
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты) Экспорт
	
	мдмБизнесПроцессыФормыСервер.ОбработатьСобытиеОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

// КОНЕЦ БизнесПроцессыФормы

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// БизнесПроцессыФормы
	мдмБизнесПроцессыФормыСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	ОткрытоТекущимПользователем = (Объект.Исполнитель = ПараметрыСеанса.ТекущийПользователь);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// БизнесПроцессыФормы
	мдмБизнесПроцессыФормыСервер.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	НастроитьФорму(ЭтотОбъект);
	
	СформироватьЗаголовок(ЭтотОбъект);
	
	// БизнесПроцессыФормы
	Подключаемый_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// БизнесПроцессыФормы
	мдмБизнесПроцессыФормыСервер.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Отказ = Не ПроверитьЗаполнение();
	
	// БизнесПроцессыФормы
	Подключаемый_ПередЗаписью(Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.Свойство("Стартовать") тогда
		
		ТекущийОбъект.ДополнительныеСвойства.Вставить("Старт");
		
	КонецЕсли;	
	
	// БизнесПроцессыФормы
	мдмБизнесПроцессыФормыСервер.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи); 
	
	// БизнесПроцессыФормы
	Подключаемый_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	СформироватьЗаголовок(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// БизнесПроцессыФормы
	Подключаемый_ПослеЗаписи(ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// БизнесПроцессыФормы
	Подключаемый_ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВзятьВРаботу" И Параметр = Объект.Ссылка тогда
		
		Прочитать();
		
		НастроитьФорму(ЭтотОбъект);
	
		СформироватьЗаголовок(ЭтотОбъект);
		
	ИначеЕсли ИмяСобытия = "ПрерватьПроцесс" И Параметр.Найти(Объект.Ссылка) <> Неопределено тогда
		
		Прочитать();
		
		НастроитьФорму(ЭтотОбъект);
	
		СформироватьЗаголовок(ЭтотОбъект);
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеОбработчикиСобытийФормы

// НАЧАЛО БизнесПроцессыФормы

&НаСервере
Процедура Подключаемый_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мдмБизнесПроцессыФормыСервер.ОбработатьСобытиеПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	мдмБизнесПроцессыФормыСервер.ОбработатьСобытиеОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	мдмБизнесПроцессыФормыКлиент.ОбработатьСобытиеПередЗаписью(ЭтотОбъект, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПослеЗаписи(ПараметрыЗаписи)
	
	мдмБизнесПроцессыФормыКлиент.ОбработатьСобытиеПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	
	мдмБизнесПроцессыФормыКлиент.ОбновитьУсловноеОформление(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	мдмБизнесПроцессыФормыСервер.ОбработатьСобытиеПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	мдмБизнесПроцессыФормыКлиент.ОбработатьСобытиеПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзменении(Элемент)
	
	мдмБизнесПроцессыФормыКлиент.ОбработатьСобытиеПриИзменении(ЭтотОбъект, Элемент.Имя);
	
	мдмБизнесПроцессыФормыКлиент.ОбновитьУсловноеОформление(ЭтотОбъект, Элемент.Имя);	
	
КонецПроцедуры	

&НаКлиенте
Процедура Подключаемый_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	мдмБизнесПроцессыФормыКлиент.ОбработатьСобытиеНачалоВыбора(ЭтотОбъект, Элемент.Имя, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	мдмБизнесПроцессыФормыКлиент.ОбработатьСобытиеОбработкаВыбора(ЭтотОбъект, Элемент.Имя, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	мдмБизнесПроцессыФормыКлиент.ОбработатьСобытиеПриНачалеРедактирования(ЭтотОбъект, Элемент.Имя, НоваяСтрока, Копирование)
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	мдмБизнесПроцессыФормыКлиент.ОбработатьСобытиеПриОкончанииРедактирования(ЭтотОбъект, Элемент.Имя, НоваяСтрока, ОтменаРедактирования)
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПередУдалением(Элемент, Отказ)
	
	мдмБизнесПроцессыФормыКлиент.ОбработатьСобытиеПередУдалением(ЭтотОбъект, Элемент.Имя, Отказ)
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПослеУдаления(Элемент)
	
	мдмБизнесПроцессыФормыКлиент.ОбработатьСобытиеПослеУдаления(ЭтотОбъект, Элемент.Имя)
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	мдмБизнесПроцессыФормыКлиент.ОбработатьСобытиеПередНачаломДобавления(ЭтотОбъект, Элемент.Имя, Отказ, Копирование, Родитель, Группа, Параметр)
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПередНачаломИзменения(Элемент, Отказ)
	
	мдмБизнесПроцессыФормыКлиент.ОбработатьСобытиеПередНачаломИзменения(ЭтотОбъект, Элемент.Имя, Отказ)
	
КонецПроцедуры

// КОНЕЦ БизнесПроцессыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

// НАЧАЛО БизнесПроцессыФормы

&НаКлиенте
Процедура Подключаемый_ДействиеКоманды(Команда)
	
	мдмБизнесПроцессыФормыКлиент.ОбработатьСобытиеДействиеКоманды(ЭтотОбъект, Команда);
	
КонецПроцедуры

// КОНЕЦ БизнесПроцессыФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьФорму(Форма)
	
	Форма.ТолькоПросмотр = Не Форма.ОткрытоТекущимПользователем ИЛИ Форма.Объект.Выполнена ИЛИ Форма.Объект.ПрерватьПроцесс;
	
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьЗаголовок(Форма)
	
	Форма.АвтоЗаголовок = Ложь;	
	
	Если Не ЗначениеЗаполнено(Форма.Объект.Исполнитель) ИЛИ Не ЗначениеЗаполнено(Форма.Объект.Ссылка) тогда
		
		Форма.АвтоЗаголовок = Истина;
		
	ИначеЕсли Форма.Объект.ПрерватьПроцесс тогда
		
		Форма.Заголовок = "" + Форма.Объект.Ссылка + " (Прервана)";
		
	ИначеЕсли Форма.Объект.Выполнена тогда
		
		Форма.Заголовок = "" + Форма.Объект.Ссылка + " (Выполнена)";
		
	Иначе 	
	
		Форма.Заголовок = "" + Форма.Объект.Ссылка + " (Выполняется)";
		
	КонецЕсли;	
	
КонецПроцедуры	

#КонецОбласти