
Перем ИзменилосьНаименование;

#Область ПрограммныйИнтерфейс

Процедура СформироватьПредставление(НаименованиеВладельца = "") Экспорт
	
	Если НаименованиеВладельца = "" тогда
		НаименованиеВладельца = Владелец.Наименование;	
	КонецЕсли;	
	
	ПредставлениеСсылки = НаименованиеВладельца + "." + Наименование;
	
КонецПроцедуры	

Функция КлючОбъекта() Экспорт
	Возврат "Имя,Владелец";
КонецФункции	

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	ИзменилосьНаименование = Наименование <> Ссылка.Наименование;
	
	СформироватьПредставление();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ИзменилосьНаименование тогда
		
		Выборка = Справочники.мдмРеквизиты.Выбрать(, Ссылка);
		Пока Выборка.Следующий() цикл
			Объект = Выборка.ПолучитьОбъект();
			Объект.СформироватьПредставление(ПредставлениеСсылки);
			Объект.Записать();
		КонецЦикла;	
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти