
#Область ПрограммныйИнтерфейс

Процедура СформироватьПредставление(НаименованиеВладельца = "") Экспорт
	
	Если НаименованиеВладельца = "" тогда
		НаименованиеВладельца = Владелец.Наименование;	
	КонецЕсли;	
	
	ПредставлениеСсылки = НаименованиеВладельца + "." + Наименование;
	
КонецПроцедуры	

Функция КлючОбъекта() Экспорт
	
	Возврат "Имя,Владелец";
	
КонецФункции	

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	СформироватьПредставление();
	
КонецПроцедуры

#КонецОбласти