
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкаПодсказок();
	
КонецПроцедуры

&НаСервере
Процедура НастройкаПодсказок()
	
	Элементы.ПроверкаУсловия.РасширеннаяПодсказка.Заголовок = мдмКонструкторФормыКлиентСервер.ФорматированнаяСтрока(
		НСтр("ru = '<b>Событие вычисления варианта перехода бизнес-процесса.</b>
		            |
					|<b>Контекст события</b>:
					|	<b>Контекст</b> - Структура - элементы структуры:
					|		Объект - БизнесПроцессОбъект.мдмПроцессОбработки - объект текущего бизнес-процесса.
					|		Варианты - ФиксированнаяСтруктура - ключи вариантов точки.
					|		Результат - Строка - выбранный вариант.'")	
		);
		
КонецПроцедуры	

&НаКлиенте
Процедура ВыходыРезультатНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Элемент.СписокВыбора.Очистить();
	
	Для Каждого СтрокаВарианта из Объект.Варианты цикл
		Элемент.СписокВыбора.Добавить(СтрокаВарианта.Имя);	
	КонецЦикла;	
	
КонецПроцедуры
