
#Область ПрограммныйИнтерфейс

Процедура ВыбратьПутьКДанным(ВладелецФормы, СхемаДанных) Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("СхемаДанных", СхемаДанных);
	Параметры.Вставить("ЗакрыватьПриВыборке", Истина);
	
	ОткрытьФорму("Справочник.мдмСхемыДанных.Форма.ВыборПутиДанных", Параметры, ВладелецФормы,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры	

Процедура ВыбратьКоманду(ВладелецФормы, ФормаДанных) Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("Форма", ФормаДанных);
	Параметры.Вставить("ЗакрыватьПриВыборке", Истина);
	
	ОткрытьФорму("Справочник.мдмФормыДанных.Форма.ФормаВыбораКоманды", Параметры, ВладелецФормы,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры	

Процедура ВыбратьУсловноеОформление(ВладелецФормы, ФормаДанных) Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("Владелец", ФормаДанных);
	
	Параметры = Новый Структура;
	Параметры.Вставить("Отбор", Отбор);
	Параметры.Вставить("ЗакрыватьПриВыборке", Истина);
	
	ОткрытьФорму("Справочник.мдмОтборы.ФормаВыбора", Параметры, ВладелецФормы,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры	

Процедура ВыбратьСвязиПараметровВыбора(ВладелецФормы, Связи) Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("Связи", Связи);
	Параметры.Вставить("ЗакрыватьПриВыборке", Истина);
	
	ОткрытьФорму("Справочник.мдмФормыДанных.Форма.СвязиПараметровВыбора", Параметры, ВладелецФормы,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры	

Процедура ПроверитьФорму(Форма, Владелец) Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("ФормаДанных", Форма);
	
	ОткрытьФорму("Справочник.мдмФормыДанных.Форма.ПроверкаФормы", Параметры, Владелец,,,,, РежимОткрытияОкнаФормы.Независимый);	
	
КонецПроцедуры	

#КонецОбласти

