
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкаПодсказок();
	
КонецПроцедуры

&НаСервере
Процедура НастройкаПодсказок()
	
	Элементы.ПередСозданиемЗадач.РасширеннаяПодсказка.Заголовок = мдмКонструкторФормыКлиентСервер.ФорматированнаяСтрока(
		НСтр("ru = '<b>Событие возникает до создания задачи.</b>
		            |
					|<b>Контекст события</b>:
					|	<b>Контекст</b> - Структура - элементы структуры:
					|		Объект - БизнесПроцессОбъект.мдмПроцессОбработки - объект текущего бизнес-процесса.
					|		Задача - ЗадачаОбъект.мдмЗадачаОбработки - объект создаваемой задачи.
					|		СтандартнаяОбработка - Булево - признак стандартного 
					|		поведения создания задачи.'")	
		);
		
	Элементы.ПриСозданииЗадачи.РасширеннаяПодсказка.Заголовок = мдмКонструкторФормыКлиентСервер.ФорматированнаяСтрока(
		НСтр("ru = '<b>Событие возникает после создания задачи:</b>
		            |
					|<b>Контекст события</b>:
					|	<b>Контекст</b> - Структура - элементы структуры:
					|		Объект - БизнесПроцессОбъект.мдмПроцессОбработки - объект текущего бизнес-процесса.
					|		Задача - ЗадачаОбъект.мдмЗадачаОбработки - объект созданной задачи.'")	
		);
		
	Элементы.ПередСозданиемБизнесПроцесса.РасширеннаяПодсказка.Заголовок = мдмКонструкторФормыКлиентСервер.ФорматированнаяСтрока(
		НСтр("ru = '<b>Событие возникает до создания задачи.</b>
		            |
					|<b>Контекст события</b>:
					|	<b>Контекст</b> - Структура - элементы структуры:
					|		Объект - БизнесПроцессОбъект.мдмПроцессОбработки - объект текущего бизнес-процесса.
					|		ФормируемыйБизнесПроцесс - БизнесПроцессОбъект.мдмПроцессОбработки - объект создаваемого бизнес-процесса.
					|		СтандартнаяОбработка - Булево - признак стандартного 
					|		поведения создания задачи.'")	
		);
		
	Элементы.ПриСозданииБизнесПроцесса.РасширеннаяПодсказка.Заголовок = мдмКонструкторФормыКлиентСервер.ФорматированнаяСтрока(
		НСтр("ru = '<b>Событие возникает после создания задачи:</b>
		            |
					|<b>Контекст события</b>:
					|	<b>Контекст</b> - Структура - элементы структуры:
					|		Объект - БизнесПроцессОбъект.мдмПроцессОбработки - объект текущего бизнес-процесса.
					|		ФормируемыйБизнесПроцесс - БизнесПроцессОбъект.мдмПроцессОбработки - объект созданного бизнес-процесса.'")	
		);
		
	Элементы.ПередВыполнением.РасширеннаяПодсказка.Заголовок = мдмКонструкторФормыКлиентСервер.ФорматированнаяСтрока(
		НСтр("ru = '<b>Событие возникает до установки признака Выполнена задачи:</b>
		            |
					|<b>Контекст события</b>:
					|	<b>Контекст</b> - Структура - элементы структуры:
					|		Объект - БизнесПроцессОбъект.мдмПроцессОбработки - объект текущего бизнес-процесса.
					|		Задача - ЗадачаОбъект.мдмЗадачаОбработки - объект выполняемой задачи.'")	
		);
		
	Элементы.ПриВыполнении.РасширеннаяПодсказка.Заголовок = мдмКонструкторФормыКлиентСервер.ФорматированнаяСтрока(
		НСтр("ru = '<b>Событие возникает после установки признака Выполнена задачи:</b>
		            |
					|<b>Контекст события</b>:
					|	<b>Контекст</b> - Структура - элементы структуры:
					|		Объект - БизнесПроцессОбъект.мдмПроцессОбработки - объект текущего бизнес-процесса.
					|		Задача - ЗадачаОбъект.мдмЗадачаОбработки - объект выполненной задачи.'")	
		);
		
КонецПроцедуры	

