
Перем ИзменилосьНаименование;

#Область ПрограммныйИнтерфейс

Функция КлючОбъекта() Экспорт
	Возврат "Имя";
КонецФункции	

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	ИзменилосьНаименование = Наименование <> Ссылка.Наименование;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ИзменилосьНаименование тогда
		
		Выборка = Справочники.мдмРеквизиты.Выбрать(, Ссылка);
		Пока Выборка.Следующий() цикл
			Объект = Выборка.ПолучитьОбъект();
			Объект.СформироватьПредставление(Наименование);
			Объект.Записать();
		КонецЦикла;	
		
		Выборка = Справочники.мдмТабличныеЧасти.Выбрать(, Ссылка);
		Пока Выборка.Следующий() цикл
			Объект = Выборка.ПолучитьОбъект();
			Объект.СформироватьПредставление(Наименование);
			Объект.Записать();
		КонецЦикла;	
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Хранилище = Перечисления.мдмХранилищеДанных.Расширение тогда
		ПроверяемыеРеквизиты.Добавить("ИмяРасширения");
		ПроверяемыеРеквизиты.Добавить("ИмяОбъектаРасширения");
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли