
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем ПолноеИмяМетаданных;
	
	Если Параметры.Свойство("ПолноеИмяМетаданных", ПолноеИмяМетаданных) тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	БизнесПроцессы.Ссылка КАК БизнесПроцесс
			|ИЗ
			|	Справочник.мдмБизнесПроцессы КАК БизнесПроцессы
			|ГДЕ
			|	БизнесПроцессы.ПометкаУдаления = ЛОЖЬ
			|	И БизнесПроцессы.Использовать = ИСТИНА
			|	И БизнесПроцессы.ПолноеИмяМетаданныхПредмета = &ПолноеИмяМетаданных			
			|
			|УПОРЯДОЧИТЬ ПО
			|	БизнесПроцессы.ПолноеИмяМетаданныхПредмета";
		
		Запрос.УстановитьПараметр("ПолноеИмяМетаданных", ПолноеИмяМетаданных);
		
		ЗначениеВРеквизитФормы(Запрос.Выполнить().Выгрузить(), "Список");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ВыбратьБизнесПроцесс();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыбратьБизнесПроцесс();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьБизнесПроцесс()
	
	ДанныеСтроки = Элементы.Список.ТекущиеДанные;
	Если ДанныеСтроки = Неопределено тогда
		ПоказатьПредупреждение(, "Выберите строку.");
		Возврат;
	КонецЕсли;	
	
	ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗакрытии, ДанныеСтроки.БизнесПроцесс);
	
	Закрыть();
	
КонецПроцедуры

