
&НаСервере
Функция ЭлементДанныхФормы() Экспорт
	
	Возврат Элементы.ДанныеПроцесса;
	
КонецФункции	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мдмБизнесПроцессыФормыСпискаСервер.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура БизнесПроцессСписокПриИзменении(Элемент)
	
	БизнесПроцессСписокПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура БизнесПроцессСписокПриИзмененииНаСервере()
	
	мдмБизнесПроцессыФормыСпискаСервер.СформироватьСписок(ЭтотОбъект);	
	
КонецПроцедуры
