
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	мдмБизнесПроцессыВызовСервера.ВзятьЗадачиВРаботу(ПараметрКоманды);
	
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("УправляемаяФорма")
		И ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Задача.мдмЗадачаОбработки.Форма.ФормаЗадачи"
		И ПараметрыВыполненияКоманды.Источник.Объект.Ссылка = ПараметрКоманды[0] тогда
		
		Оповестить("ВзятьВРаботу", ПараметрКоманды[0]);
		
	Иначе 	
		
		Если ПараметрКоманды.Количество() = 1 И ЗадачаВзятаВРаботу(ПараметрКоманды[0]) тогда
			ПоказатьЗначение(, ПараметрКоманды[0]);
		КонецЕсли;	
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗадачаВзятаВРаботу(Задача)
	Возврат Задача.Исполнитель = ПараметрыСеанса.ТекущийПользователь И Не Задача.Выполнена И Не Задача.ПрерватьПроцесс;
КонецФункции	
