
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Типы = ТекущийОбъект.мдмТипыОбъектовМастерДанных.Получить();
	Если ТипЗнч(Типы) = Тип("ОписаниеТипов") тогда
		ТипыОбъектовМастерДанных = Типы;	
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ТипыОбъектовМастерДанных.ДоступныеТипы = Метаданные.ОпределяемыеТипы.мдмМастерДанные.Тип;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.мдмТипыОбъектовМастерДанных = Новый ХранилищеЗначения(ТипыОбъектовМастерДанных);
	
КонецПроцедуры

