

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкаФормы(ЭтотОбъект);
	
	НастройкаПодсказок();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОбработатьАвтоматическиПриИзменении(Элемент)
	
	НастройкаФормы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастройкаФормы(Форма)
	
	Форма.Элементы.СтраницаАвтоматическаяОбработка.Видимость = Форма.Объект.ОбработатьАвтоматически;
	
КонецПроцедуры	

&НаСервере
Процедура НастройкаПодсказок()
	
	Элементы.ПередСозданиемЗадач.РасширеннаяПодсказка.Заголовок = мдмКонструкторФормыКлиентСервер.ФорматированнаяСтрока(
		НСтр("ru = '<b>Событие возникает до создания задачи.</b>
		            |
					|<b>Контекст события</b>:
					|	<b>Контекст</b> - Структура - элементы структуры:
					|		Объект - БизнесПроцессОбъект.мдмПроцессОбработки - объект текущего бизнес-процесса.
					|		Задача - ЗадачаОбъект.мдмЗадачаОбработки - объект создаваемой задачи.
					|		СтандартнаяОбработка - Булево - признак стандартного 
					|		поведения создания задачи.'")	
		);
		
	Элементы.ПриСозданииЗадачи.РасширеннаяПодсказка.Заголовок = мдмКонструкторФормыКлиентСервер.ФорматированнаяСтрока(
		НСтр("ru = '<b>Событие возникает после создания задачи:</b>
		            |
					|<b>Контекст события</b>:
					|	<b>Контекст</b> - Структура - элементы структуры:
					|		Объект - БизнесПроцессОбъект.мдмПроцессОбработки - объект текущего бизнес-процесса.
					|		Задача - ЗадачаОбъект.мдмЗадачаОбработки - объект созданной задачи.'")	
		);
		
	Элементы.ОбработкаПроверкиВыполнения.РасширеннаяПодсказка.Заголовок = мдмКонструкторФормыКлиентСервер.ФорматированнаяСтрока(
		НСтр("ru = '<b>Событие проверки возможности выполнения задачи.</b>
		            |
					|<b>Контекст события</b>:
					|	<b>Контекст</b> - Структура - элементы структуры:
					|		Объект - БизнесПроцессОбъект.мдмПроцессОбработки - объект текущего бизнес-процесса.
					|		Задача - ЗадачаОбъект.мдмЗадачаОбработки - объект проверяемой задачи.
					|		Результат - Булево - Ложь - отказ от выполнения, Истина - успех.'")	
		);
		
	Элементы.ПередВыполнением.РасширеннаяПодсказка.Заголовок = мдмКонструкторФормыКлиентСервер.ФорматированнаяСтрока(
		НСтр("ru = '<b>Событие возникает до установки признака Выполнена задачи:</b>
		            |
					|<b>Контекст события</b>:
					|	<b>Контекст</b> - Структура - элементы структуры:
					|		Объект - БизнесПроцессОбъект.мдмПроцессОбработки - объект текущего бизнес-процесса.
					|		Задача - ЗадачаОбъект.мдмЗадачаОбработки - объект выполняемой задачи.'")	
		);
		
	Элементы.ПриВыполнении.РасширеннаяПодсказка.Заголовок = мдмКонструкторФормыКлиентСервер.ФорматированнаяСтрока(
		НСтр("ru = '<b>Событие возникает после установки признака Выполнена задачи:</b>
		            |
					|<b>Контекст события</b>:
					|	<b>Контекст</b> - Структура - элементы структуры:
					|		Объект - БизнесПроцессОбъект.мдмПроцессОбработки - объект текущего бизнес-процесса.
					|		Задача - ЗадачаОбъект.мдмЗадачаОбработки - объект выполненной задачи.'")	
		);
		
КонецПроцедуры	

#КонецОбласти