
#Область ПрограммныйИнтерфейс

Функция МенеджерТочки(ЭлементКарты) Экспорт
	
	Если ТипЗнч(ЭлементКарты) = Тип("ЭлементГрафическойСхемыСтарт") тогда
		
		МенеджерТочки = Справочники.мдмТочкиСтарт;
		
	ИначеЕсли ТипЗнч(ЭлементКарты) = Тип("ЭлементГрафическойСхемыЗавершение") тогда	
		
		МенеджерТочки = Справочники.мдмТочкиЗавершение;
		
	ИначеЕсли ТипЗнч(ЭлементКарты) = Тип("ЭлементГрафическойСхемыУсловие") тогда		
		
		МенеджерТочки = Справочники.мдмТочкиУсловие;
		
	ИначеЕсли ТипЗнч(ЭлементКарты) = Тип("ЭлементГрафическойСхемыДействие") тогда				
		
		МенеджерТочки = Справочники.мдмТочкиДействие;
		
	ИначеЕсли ТипЗнч(ЭлементКарты) = Тип("ЭлементГрафическойСхемыОбработка") тогда				
		
		МенеджерТочки = Справочники.мдмТочкиОбработка;
		
	ИначеЕсли ТипЗнч(ЭлементКарты) = Тип("ЭлементГрафическойСхемыВложенныйБизнесПроцесс") тогда				
		
		МенеджерТочки = Справочники.мдмТочкиВложенныйПроцесс;
		
	ИначеЕсли ТипЗнч(ЭлементКарты) = Тип("ЭлементГрафическойСхемыРазделение") тогда				
		
		МенеджерТочки = Справочники.мдмТочкиРазделение;
		
	ИначеЕсли ТипЗнч(ЭлементКарты) = Тип("ЭлементГрафическойСхемыСлияние") тогда				
		
		МенеджерТочки = Справочники.мдмТочкиСлияние;
		
	ИначеЕсли ТипЗнч(ЭлементКарты) = Тип("ЭлементГрафическойСхемыВыборВарианта") тогда				
		
		МенеджерТочки = Справочники.мдмТочкиВыборВарианта;
		
	Иначе 
		
		МенеджерТочки = Неопределено;
		
	КонецЕсли;	
	
	Возврат МенеджерТочки;
	
КонецФункции	

Процедура ОбновитьПодсказкиЭлементовКарты(Карта) Экспорт
	
	ШаблонПодсказкиЛинии = "%1 (%2 -> %3)";
	
	Для Каждого ЭлементКарты из Карта.ЭлементыГрафическойСхемы цикл
		
		ТипЭлемента = ТипЗнч(ЭлементКарты);
		
		Если ТипЭлемента = Тип("ЭлементГрафическойСхемыСоединительнаяЛиния")
			ИЛИ ТипЭлемента = Тип("ЭлементГрафическойСхемыДекоративнаяЛиния")тогда
			
			ЭлементКарты.Подсказка = СтрШаблон(ШаблонПодсказкиЛинии,
				ЭлементКарты.Имя,
				НаименованиеЭлементаКарты(ЭлементКарты.НачалоЭлемент),
				НаименованиеЭлементаКарты(ЭлементКарты.КонецЭлемент)
			);
			
		Иначе
			
			ЭлементКарты.Подсказка = ЭлементКарты.Наименование;
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НаименованиеЭлементаКарты(ЭлементКарты)
	
	Возврат ?(ЭлементКарты = Неопределено, "", ЭлементКарты.Наименование)	
	
КонецФункции

#КонецОбласти