
#Область ПрограммныйИнтерфейс

Функция ТекущиеТочкиБизнесПроцесса(БизнесПроцесс) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачаОбработки.Ссылка КАК Ссылка,
		|	ЗадачаОбработки.Исполнитель КАК Исполнитель,
		|	ЗадачаОбработки.ТочкаБизнесПроцесса.Имя КАК ИмяТочки
		|ИЗ
		|	Задача.мдмЗадачаОбработки КАК ЗадачаОбработки
		|ГДЕ
		|	ЗадачаОбработки.БизнесПроцесс = &БизнесПроцесс
		|	И ЗадачаОбработки.Выполнена = ЛОЖЬ
		|	И ЗадачаОбработки.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("БизнесПроцесс", БизнесПроцесс);
	
	Результат = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(
			Новый Структура("Ссылка, Исполнитель, ИмяТочки",
				Выборка.Ссылка, 
				Выборка.Исполнитель,
				Выборка.ИмяТочки
			)
		);
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции

Функция ВыполненныеТочкиБизнесПроцесса(БизнесПроцесс) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|   ЗадачаОбработки.Ссылка КАК Ссылка,
		|   ЗадачаОбработки.Исполнитель КАК Исполнитель,
		|	ЗадачаОбработки.ТочкаБизнесПроцесса.Имя КАК ИмяТочки
		|ИЗ
		|	Задача.мдмЗадачаОбработки КАК ЗадачаОбработки
		|ГДЕ
		|	ЗадачаОбработки.БизнесПроцесс = &БизнесПроцесс
		|	И ЗадачаОбработки.Выполнена = ИСТИНА
		|	И ЗадачаОбработки.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("БизнесПроцесс", БизнесПроцесс);
	
	Результат = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(
			Новый Структура("Ссылка, Исполнитель, ИмяТочки",
				Выборка.Ссылка, 
				Выборка.Исполнитель,
				Выборка.ИмяТочки
			)
		);
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции

Функция ТочкаСтарт(БизнесПроцесс) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТочкиБизнесПроцесса.Точка КАК Точка
		|ИЗ
		|	Справочник.мдмТочкиБизнесПроцесса КАК ТочкиБизнесПроцесса
		|ГДЕ
		|	ТочкиБизнесПроцесса.Владелец = &БизнесПроцесс
		|	И ТочкиБизнесПроцесса.Точка ССЫЛКА Справочник.мдмТочкиСтарт";
	
	Запрос.УстановитьПараметр("БизнесПроцесс", БизнесПроцесс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() тогда
		Возврат Справочники.мдмТочкиСтарт.ПустаяСсылка();
	Иначе 
		Выборка = РезультатЗапроса.Выбрать();		
		Выборка.Следующий();
		Возврат Выборка.Точка;
	КонецЕсли;	
	
КонецФункции	

Функция ТочкаЗавершение(БизнесПроцесс) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТочкиБизнесПроцесса.Точка КАК Точка
		|ИЗ
		|	Справочник.мдмТочкиБизнесПроцесса КАК ТочкиБизнесПроцесса
		|ГДЕ
		|	ТочкиБизнесПроцесса.Владелец = &БизнесПроцесс
		|	И ТочкиБизнесПроцесса.Точка ССЫЛКА Справочник.мдмТочкиЗавершение";
	
	Запрос.УстановитьПараметр("БизнесПроцесс", БизнесПроцесс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() тогда
		Возврат Справочники.мдмТочкиЗавершение.ПустаяСсылка();
	Иначе 
		Выборка = РезультатЗапроса.Выбрать();		
		Выборка.Следующий();
		Возврат Выборка.Точка;
	КонецЕсли;	
	
КонецФункции	

#КонецОбласти
