
#Область ПрограммныйИнтерфейс

&НаСервере
Функция ЭлементДанныхФормы() Экспорт
	
	Возврат Элементы.ГруппаФормы;
	
КонецФункции	

&НаСервере
Процедура ОбновитьУсловноеОформлениеНаСервере() Экспорт
	
	мдмБизнесПроцессыФормыСервер.ОбновитьУсловноеОформление(ЭтотОбъект);
	
КонецПроцедуры	

&НаСервере
Процедура ПриИзмененииНаСервере(ИмяЭлемента) Экспорт
	
	мдмБизнесПроцессыФормыСервер.ОбработатьСобытиеПриИзмененииНаСервере(ЭтотОбъект, ИмяЭлемента);
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриОбработкеОповещения(Результат, ДополнительныеПараметры) Экспорт
	
	мдмБизнесПроцессыФормыКлиент.ОбработатьСобытиеПриОбработкеОповещения(ЭтотОбъект, Результат, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОбработкеОповещенияОдинПараметр(ДополнительныеПараметры) Экспорт
	
	мдмБизнесПроцессыФормыКлиент.ОбработатьСобытиеПриОбработкеОповещения(ЭтотОбъект, Неопределено, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ДействиеНаСервере(Имя, ВходныеПараметры, ВыходныеПараметры) Экспорт
	
	мдмБизнесПроцессыФормыСервер.ОбработатьСобытиеДействиеНаСервере(ЭтотОбъект, Имя, ВходныеПараметры, ВыходныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ДействиеКомандыНаСервере(Команда) Экспорт
	
	мдмБизнесПроцессыФормыСервер.ОбработатьСобытиеДействиеКомандыНаСервере(ЭтотОбъект, Команда);
	
КонецПроцедуры	

&НаСервере
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты) Экспорт
	
	мдмБизнесПроцессыФормыСервер.ОбработатьСобытиеОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ФормаДанных", ФормаДанных);
	
	мдмБизнесПроцессыФормыСервер.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	Подключаемый_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	мдмБизнесПроцессыФормыСервер.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Подключаемый_ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеФормыДанных" И Параметр = ФормаДанных тогда
		ОбновитьФормуНаСервере();	
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеОбработчикиСобытийФормы

&НаСервере
Процедура Подключаемый_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мдмБизнесПроцессыФормыСервер.ОбработатьСобытиеПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	мдмБизнесПроцессыФормыКлиент.ОбработатьСобытиеПередЗаписью(ЭтотОбъект, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	мдмБизнесПроцессыФормыСервер.ОбработатьСобытиеПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	мдмБизнесПроцессыФормыКлиент.ОбработатьСобытиеПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзменении(Элемент)
	
	мдмБизнесПроцессыФормыКлиент.ОбработатьСобытиеПриИзменении(ЭтотОбъект, Элемент.Имя);
	
	мдмБизнесПроцессыФормыКлиент.ОбновитьУсловноеОформление(ЭтотОбъект, Элемент.Имя);	
	
КонецПроцедуры	

&НаКлиенте
Процедура Подключаемый_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	мдмБизнесПроцессыФормыКлиент.ОбработатьСобытиеНачалоВыбора(ЭтотОбъект, Элемент.Имя, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	мдмБизнесПроцессыФормыКлиент.ОбработатьСобытиеОбработкаВыбора(ЭтотОбъект, Элемент.Имя, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	мдмБизнесПроцессыФормыКлиент.ОбработатьСобытиеПриНачалеРедактирования(ЭтотОбъект, Элемент.Имя, НоваяСтрока, Копирование)
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	мдмБизнесПроцессыФормыКлиент.ОбработатьСобытиеПриОкончанииРедактирования(ЭтотОбъект, Элемент.Имя, НоваяСтрока, ОтменаРедактирования)
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПередУдалением(Элемент, Отказ)
	
	мдмБизнесПроцессыФормыКлиент.ОбработатьСобытиеПередУдалением(ЭтотОбъект, Элемент.Имя, Отказ)
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПослеУдаления(Элемент)
	
	мдмБизнесПроцессыФормыКлиент.ОбработатьСобытиеПослеУдаления(ЭтотОбъект, Элемент.Имя)
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	мдмБизнесПроцессыФормыКлиент.ОбработатьСобытиеПередНачаломДобавления(ЭтотОбъект, Элемент.Имя, Отказ, Копирование, Родитель, Группа, Параметр)
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПередНачаломИзменения(Элемент, Отказ)
	
	мдмБизнесПроцессыФормыКлиент.ОбработатьСобытиеПередНачаломИзменения(ЭтотОбъект, Элемент.Имя, Отказ)
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьФорму(Команда)
	
	ОбновитьФормуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьФормуНаСервере()
	
	Попытка
		мдмБизнесПроцессыФормыСервер.СоздатьОбновитьФормуДанных(ЭтотОбъект);
		ОбновитьУсловноеОформлениеНаСервере();
	Исключение
		мдмОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;	
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДействиеКоманды(Команда)
	
	мдмБизнесПроцессыФормыКлиент.ОбработатьСобытиеДействиеКоманды(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаЗаполнения(Команда)
	
	ПроверитьЗаполнение();	
	
КонецПроцедуры

#КонецОбласти