
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Тип = ТекущийОбъект.Тип.Получить();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем ЗначениеКопирования;
	
	УстановитьДопустимыеТипыРеквизита();
	
	Если Параметры.Свойство("ЗначениеКопирования", ЗначениеКопирования) И ЗначениеЗаполнено(ЗначениеКопирования) Тогда
		
		Тип = ЗначениеКопирования.Тип.Получить();
		
	КонецЕсли;	
	
	Элементы.ЗначениеЗаполнения.Видимость = (ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.мдмСхемыДанных"));
	Элементы.ЗначениеЗаполнения.СвязьПоТипу = Новый СвязьПоТипу("Тип");
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Тип = Новый ХранилищеЗначения(Тип);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ОписаниеОповещенияОЗакрытии <> Неопределено Тогда
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗакрытии);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДопустимыеТипыРеквизита()
	
	Элементы.Тип.ДоступныеТипы = мдмМетаданные.ДопустимыеТипыРеквизитов();
	
КонецПроцедуры	

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	
	Объект.ТипПредставление = мдмМетаданныеВызовСервера.ПредставлениеТипа(Тип);
	
КонецПроцедуры
