
#Область ПрограммныйИнтерфейс

Функция СтартоватьНаКлиенте(Форма) Экспорт
	
	Если Не Форма.ПроверитьЗаполнение() тогда
		Возврат Ложь;
	КонецЕсли;	
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("Стартовать");
	
	Возврат Форма.Записать(ПараметрыЗаписи);

КонецФункции

Процедура СтартоватьИЗакрыть(Форма) Экспорт
	
	Если СтартоватьНаКлиенте(Форма) тогда
		ОповеститьОбИзменении(Форма.Объект.Ссылка);
		Форма.Закрыть();
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОткрытьКартуМаршрута(ПроцессОбработки) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПроцессОбработки", ПроцессОбработки);
	
	ОткрытьФорму("БизнесПроцесс.мдмПроцессОбработки.Форма.КартаМаршрута", ПараметрыФормы,,,,,, РежимОткрытияОкнаФормы.Независимый); 
	
КонецПроцедуры	

#Область ПодключаемыеСобытия

Процедура ОбновитьУсловноеОформление(Форма, Элемент = Неопределено) Экспорт
	
	Перем СвойстваЭлемента, ОбновлятьУсловноеОформление; 
	
	Если Элемент = Неопределено тогда	
		
		Форма.ОбновитьУсловноеОформлениеНаСервере();
	
	ИначеЕсли Форма.ДобавленныеЭлементы.Свойство(Элемент, СвойстваЭлемента) 
		И СвойстваЭлемента.Свойство("ОбновлятьУсловноеОформление", ОбновлятьУсловноеОформление)
		И ОбновлятьУсловноеОформление = Истина тогда
		
		Форма.ОбновитьУсловноеОформлениеНаСервере();
		
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ОбработатьСобытиеПриОбработкеОповещения(Форма, Результат, ДополнительныеПараметры) Экспорт
	
	мдмБизнесПроцессыФормыКлиентПереопределяемый.ОбработатьСобытиеПриОбработкеОповещения(Форма, Результат, ДополнительныеПараметры);
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("Результат", Результат);
	ПараметрыСобытия.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	
	мдмБизнесПроцессыФормыКлиентСервер.ОбработатьСобытие(Форма, "Форма", "ПриОбработкеОповещения", ПараметрыСобытия);
	
	ПараметрыСобытия.Свойство("Результат", Результат);
	ПараметрыСобытия.Свойство("ДополнительныеПараметры", ДополнительныеПараметры);
	
КонецПроцедуры	

Процедура ОбработатьСобытиеПередЗаписью(Форма, Отказ, ПараметрыЗаписи) Экспорт 
	
	мдмБизнесПроцессыФормыКлиентПереопределяемый.ОбработатьСобытиеПередЗаписью(Форма, Отказ, ПараметрыЗаписи);
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("Отказ", Отказ);
	ПараметрыСобытия.Вставить("ПараметрыЗаписи", ПараметрыЗаписи);
	
	мдмБизнесПроцессыФормыКлиентСервер.ОбработатьСобытие(Форма, "Форма", "ПередЗаписью", ПараметрыСобытия);
	
	ПараметрыСобытия.Свойство("Отказ", Отказ);
	ПараметрыСобытия.Свойство("ПараметрыЗаписи", ПараметрыЗаписи);
	
КонецПроцедуры	

Процедура ОбработатьСобытиеПослеЗаписи(Форма, ПараметрыЗаписи) Экспорт
	
	мдмБизнесПроцессыФормыКлиентПереопределяемый.ОбработатьСобытиеПослеЗаписи(Форма, ПараметрыЗаписи);
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("ПараметрыЗаписи", ПараметрыЗаписи);
	
	мдмБизнесПроцессыФормыКлиентСервер.ОбработатьСобытие(Форма, "Форма", "ПослеЗаписи", ПараметрыСобытия);
	
КонецПроцедуры	

Процедура ОбработатьСобытиеПередЗакрытием(Форма, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Экспорт 
	
	мдмБизнесПроцессыФормыКлиентПереопределяемый.ОбработатьСобытиеПередЗакрытием(Форма, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("Отказ", Отказ);
	ПараметрыСобытия.Вставить("ЗавершениеРаботы", ЗавершениеРаботы);
	ПараметрыСобытия.Вставить("ТекстПредупреждения", ТекстПредупреждения);
	ПараметрыСобытия.Вставить("СтандартнаяОбработка", СтандартнаяОбработка);
	
	мдмБизнесПроцессыФормыКлиентСервер.ОбработатьСобытие(Форма, "Форма", "ПередЗакрытием", ПараметрыСобытия);
	
	ПараметрыСобытия.Свойство("Отказ", Отказ);
	ПараметрыСобытия.Свойство("ЗавершениеРаботы", ЗавершениеРаботы);
	ПараметрыСобытия.Свойство("ТекстПредупреждения", ТекстПредупреждения);
	ПараметрыСобытия.Свойство("СтандартнаяОбработка", СтандартнаяОбработка);
	
КонецПроцедуры	

Процедура ОбработатьСобытиеПриИзменении(Форма, Элемент) Экспорт
	
	мдмБизнесПроцессыФормыКлиентПереопределяемый.ОбработатьСобытиеПриИзменении(Форма, Элемент);
	
	мдмБизнесПроцессыФормыКлиентСервер.ОбработатьСобытие(Форма, Элемент, "ПриИзменении");	
	
КонецПроцедуры	

Процедура ОбработатьСобытиеНачалоВыбора(Форма, Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	
	мдмБизнесПроцессыФормыКлиентПереопределяемый.ОбработатьСобытиеНачалоВыбора(Форма, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("ДанныеВыбора", ДанныеВыбора);
	ПараметрыСобытия.Вставить("СтандартнаяОбработка", СтандартнаяОбработка);
	
	мдмБизнесПроцессыФормыКлиентСервер.ОбработатьСобытие(Форма, Элемент, "НачалоВыбора", ПараметрыСобытия);
	
	ПараметрыСобытия.Свойство("ДанныеВыбора", ДанныеВыбора);
	ПараметрыСобытия.Свойство("СтандартнаяОбработка", СтандартнаяОбработка);
	
КонецПроцедуры	

Процедура ОбработатьСобытиеОбработкаВыбора(Форма, Элемент, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт
	
	мдмБизнесПроцессыФормыКлиентПереопределяемый.ОбработатьСобытиеОбработкаВыбора(Форма, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("ВыбранноеЗначение", ВыбранноеЗначение);
	ПараметрыСобытия.Вставить("СтандартнаяОбработка", СтандартнаяОбработка);
	
	мдмБизнесПроцессыФормыКлиентСервер.ОбработатьСобытие(Форма, Элемент, "ОбработкаВыбора", ПараметрыСобытия);
	
	ПараметрыСобытия.Свойство("ВыбранноеЗначение", ВыбранноеЗначение);
	ПараметрыСобытия.Свойство("СтандартнаяОбработка", СтандартнаяОбработка);
	
КонецПроцедуры	

Процедура ОбработатьСобытиеПриНачалеРедактирования(Форма, Элемент, НоваяСтрока, Копирование) Экспорт
	
	мдмБизнесПроцессыФормыКлиентПереопределяемый.ОбработатьСобытиеПриНачалеРедактирования(Форма, Элемент, НоваяСтрока, Копирование);
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("НоваяСтрока", НоваяСтрока);
	ПараметрыСобытия.Вставить("Копирование", Копирование);
	
	мдмБизнесПроцессыФормыКлиентСервер.ОбработатьСобытие(Форма, Элемент, "ПриНачалеРедактирования", ПараметрыСобытия);
	
	ПараметрыСобытия.Свойство("НоваяСтрока", НоваяСтрока);
	ПараметрыСобытия.Свойство("Копирование", Копирование);
	
КонецПроцедуры

Процедура ОбработатьСобытиеПриОкончанииРедактирования(Форма, Элемент, НоваяСтрока, ОтменаРедактирования) Экспорт
	
	мдмБизнесПроцессыФормыКлиентПереопределяемый.ОбработатьСобытиеПриОкончанииРедактирования(Форма, Элемент, НоваяСтрока, ОтменаРедактирования);
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("НоваяСтрока", НоваяСтрока);
	ПараметрыСобытия.Вставить("ОтменаРедактирования", ОтменаРедактирования);
	
	мдмБизнесПроцессыФормыКлиентСервер.ОбработатьСобытие(Форма, Элемент, "ПриОкончанииРедактирования", ПараметрыСобытия);
	
	ПараметрыСобытия.Свойство("НоваяСтрока", НоваяСтрока);
	ПараметрыСобытия.Свойство("ОтменаРедактирования", ОтменаРедактирования);
	
КонецПроцедуры

Процедура ОбработатьСобытиеПередУдалением(Форма, Элемент, Отказ) Экспорт
	
	мдмБизнесПроцессыФормыКлиентПереопределяемый.ОбработатьСобытиеПередУдалением(Форма, Элемент, Отказ);
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("Отказ", Отказ);
	
	мдмБизнесПроцессыФормыКлиентСервер.ОбработатьСобытие(Форма, Элемент, "ПередУдалением", ПараметрыСобытия);
	
	ПараметрыСобытия.Свойство("Отказ", Отказ);
	
КонецПроцедуры

Процедура ОбработатьСобытиеПослеУдаления(Форма, Элемент) Экспорт
	
	мдмБизнесПроцессыФормыКлиентПереопределяемый.ОбработатьСобытиеПослеУдаления(Форма, Элемент);
	
	мдмБизнесПроцессыФормыКлиентСервер.ОбработатьСобытие(Форма, Элемент, "ПослеУдаления");

КонецПроцедуры

Процедура ОбработатьСобытиеПередНачаломДобавления(Форма, Элемент, Отказ, Копирование, Родитель, Группа, Параметр) Экспорт
	
	мдмБизнесПроцессыФормыКлиентПереопределяемый.ОбработатьСобытиеПередНачаломДобавления(Форма, Элемент, Отказ, Копирование, Родитель, Группа, Параметр);
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("Отказ", Отказ);
	ПараметрыСобытия.Вставить("Копирование", Копирование);
	ПараметрыСобытия.Вставить("Родитель", Родитель);
	ПараметрыСобытия.Вставить("Группа", Группа);
	ПараметрыСобытия.Вставить("Параметр", Параметр);
	
	мдмБизнесПроцессыФормыКлиентСервер.ОбработатьСобытие(Форма, Элемент, "ПередНачаломДобавления", ПараметрыСобытия);
	
	ПараметрыСобытия.Свойство("Отказ", Отказ);
	ПараметрыСобытия.Свойство("Копирование", Копирование);
	ПараметрыСобытия.Свойство("Родитель", Родитель);
	ПараметрыСобытия.Свойство("Группа", Группа);
	ПараметрыСобытия.Свойство("Параметр", Параметр);
	
КонецПроцедуры

Процедура ОбработатьСобытиеПередНачаломИзменения(Форма, Элемент, Отказ) Экспорт
	
	мдмБизнесПроцессыФормыКлиентПереопределяемый.ОбработатьСобытиеПередНачаломИзменения(Форма, Элемент, Отказ);
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("Отказ", Отказ);
	
	мдмБизнесПроцессыФормыКлиентСервер.ОбработатьСобытие(Форма, Элемент, "ПередНачаломИзменения", ПараметрыСобытия);
	
	ПараметрыСобытия.Свойство("Отказ", Отказ);
	
КонецПроцедуры	

Процедура ОбработатьСобытиеДействиеКоманды(Форма, Команда) Экспорт
	
	мдмБизнесПроцессыФормыКлиентПереопределяемый.ОбработатьСобытиеДействиеКоманды(Форма, Команда);
	
	мдмБизнесПроцессыФормыКлиентСервер.ОбработатьКоманду(Форма, Команда, "Клиент");
	
КонецПроцедуры	

#КонецОбласти

#КонецОбласти