
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкаПодсказок();
	
КонецПроцедуры

&НаСервере
Процедура НастройкаПодсказок()
	
	Элементы.ПриЗавершении.РасширеннаяПодсказка.Заголовок = мдмКонструкторФормыКлиентСервер.ФорматированнаяСтрока(
		НСтр("ru = '<b>Событие при завершении бизнес-процесса.</b>
		            |
					|<b>Контекст события</b>:
					|	<b>Контекст</b> - Структура - элементы структуры:
					|		Объект - БизнесПроцессОбъект.мдмПроцессОбработки - объект текущего бизнес-процесса.'")	
		);
		
КонецПроцедуры	
