
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем Форма;
	
	Если Параметры.Свойство("Форма", Форма) тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КомандыФормы.Имя КАК ИмяКоманды
			|ИЗ
			|	Справочник.мдмКомандыФорм КАК КомандыФормы
			|ГДЕ
			|	КомандыФормы.Владелец = &Форма
			|
			|УПОРЯДОЧИТЬ ПО
			|	ИмяКоманды";
		
		Запрос.УстановитьПараметр("Форма", Форма);
		
		ЗначениеВРеквизитФормы(Запрос.Выполнить().Выгрузить(), "Список");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ВыбратьКоманду();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыбратьКоманду();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКоманду()
	
	ДанныеСтроки = Элементы.Список.ТекущиеДанные;
	Если ДанныеСтроки = Неопределено тогда
		ПоказатьПредупреждение(, "Выберите строку.");
		Возврат;
	КонецЕсли;	
	
	ОповеститьОВыборе(ДанныеСтроки.ИмяКоманды);
	
КонецПроцедуры

